let a = 1, b = 1;
let c = ++a;//2 тк старое значение а увеличивается на 1 и присваивается с следовательно с=2
let d = b++;//1 тк старое значение b это 1 и оно присваивается d следовтельно d=1
'a=2';//тк префиксная форма увеличила занчение а на 1 и получилось 2
'b=2';//тк постфиксная форма b увеличила значение b на 1 и присвоила сразу это значение d которое теперь равно 1 и увеличила старое значение b на 1 следоваельно b=2
'c=2';//тк с было присвоено значение а которое равно 2
'd=1';//тк d было присвоено старое значение b котрое было равно 1