//чему будут равны значения ниже?
"" + 1 + 0;
"" + 1; //"1"
"1" + 0; // "10"

"" - 1 + 0;
"" - 1;// -1, тк пустая строка "" при вычитании приводится к 0
-1 + 0;// -1

true + false;
alert (+true);//1
alert (+false);//0
alert ((+true) + (+false));// 1

6 / "3";
alert (6 / (Number("3")));// 6/3; 2

"2" * "3";
alert ("2" * "3");// 2*3; 6

4 + 5 + "px";// "9px"

"$" + 4 + 5;// "$9"

"4" - 2; //4-2; 2

"4px" - 2;// NaN-2

"  -9  " + 5;// "-95", тк сложение со строкой преобразовало 5 в строку и сложило с "-9"

"  -9  " - 5;
alert ("-9" - 5);// -9-5; -14

null + 1;// 0+1; 1 тк null преобразовывается в 0

undefined + 1;// NaN тк undefined преообразовывается  в NaN

" \t \n" - 2;// 0 - 2; -2 

